#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

data.aws_vpc.vpc: Reading...
data.aws_security_group.security_group: Reading...
data.aws_security_group.security_group: Read complete after 0s [id=sg-0e50f133f17baacc3]
aws_db_instance.rds_postgresql: Refreshing state... [id=db-F4FQKYJNKYMH76T22CMXZPGTRQ]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-00f5f0e1d79134868]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-0e0c9b208a1acef9c"]: Reading...
data.aws_subnet.subnet["subnet-04e4f724dfc4ee4b5"]: Reading...
data.aws_subnet.subnet["subnet-0863a64f28eaa6110"]: Reading...
data.aws_subnet.subnet["subnet-0ee9a5fb5f6dab9f4"]: Reading...
data.aws_subnet.subnet["subnet-0287f396bd4ea2cd4"]: Reading...
data.aws_subnet.subnet["subnet-02c13fe6eff28a48d"]: Reading...
data.aws_subnet.subnet["subnet-0863a64f28eaa6110"]: Read complete after 0s [id=subnet-0863a64f28eaa6110]
data.aws_subnet.subnet["subnet-02c13fe6eff28a48d"]: Read complete after 0s [id=subnet-02c13fe6eff28a48d]
data.aws_subnet.subnet["subnet-0e0c9b208a1acef9c"]: Read complete after 0s [id=subnet-0e0c9b208a1acef9c]
data.aws_subnet.subnet["subnet-0ee9a5fb5f6dab9f4"]: Read complete after 0s [id=subnet-0ee9a5fb5f6dab9f4]
data.aws_subnet.subnet["subnet-04e4f724dfc4ee4b5"]: Read complete after 0s [id=subnet-04e4f724dfc4ee4b5]
data.aws_subnet.subnet["subnet-0287f396bd4ea2cd4"]: Read complete after 0s [id=subnet-0287f396bd4ea2cd4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_subnet_group.rds_subnet_group will be created
  + resource "aws_db_subnet_group" "rds_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "fiap-tech-challenge-rds-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0287f396bd4ea2cd4",
          + "subnet-02c13fe6eff28a48d",
          + "subnet-0863a64f28eaa6110",
          + "subnet-0e0c9b208a1acef9c",
          + "subnet-0ee9a5fb5f6dab9f4",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "fiap-tech-challenge-rds-subnet-group"
        }
      + tags_all                = {
          + "Name" = "fiap-tech-challenge-rds-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>
*Pushed by: @rafabernardo, Action: `pull_request`*